Repository: lionzentany-source/clothes_pos
Catalog: lib/l10n_clean/app_*.arb
Languages: ar

# appTitle
source: Clothes POS
ar: نقطة بيع الملابس

# loginTitle
source: Login
ar: تسجيل الدخول

# loginEnterPassword
source: Enter password
ar: أدخل كلمة المرور

# loginCancel
source: Cancel
ar: إلغاء

# loginContinue
source: Continue
ar: متابعة

# loginInvalid
source: Invalid credentials
ar: بيانات الدخول غير صحيحة

# loginNoUsers
source: No active users
ar: لا يوجد مستخدمون نشطون

# posTab
source: Sales
ar: المبيعات

# inventoryTab
source: Inventory
ar: المخزون

# reportsTab
source: Reports
ar: التقارير

# settingsTab
source: Settings
ar: الإعدادات

# posTotal
source: Total
ar: الإجمالي

# posCart
source: Cart
ar: السلة

# sessionNone
source: No session
ar: لا توجد جلسة

# sessionOpen
source: Session #
ar: جلسة #

source: Cash Session
ar: الجلسة النقدية

source: Open
ar: فتح

source: Close
ar: إغلاق

source: Deposit
ar: إيداع

source: Withdraw
ar: سحب

source: X Report
ar: تقرير X

source: Z Report
ar: تقرير Z

# settingsTitle
source: Settings
ar: الإعدادات

# generalSection
source: General
ar: عام

# storeInfo
source: Store Information
ar: معلومات المتجر

source: Language & Currency
ar: اللغة والعملة

source: Change Password
ar: تغيير كلمة المرور

# databaseSection
source: Database
ar: قاعدة البيانات

# dbBackupRestore
source: Backup / Restore Database
ar: نسخ/استعادة قاعدة البيانات

# inventoryPrintRfidSection
source: Inventory, Printing & RFID
ar: المخزون والطباعة وRFID

source: Inventory Settings
ar: إعدادات المخزون

source: Printing Settings
ar: إعدادات الطباعة

source: RFID Settings
ar: إعدادات RFID

# userAccountSection
source: User Account
ar: حساب المستخدم

source: Logout
ar: تسجيل الخروج

# logoutConfirmCloseSessionTitle
source: Close Session
ar: إغلاق الجلسة

# logoutConfirmCloseSessionAmount
source: Closing amount
ar: المبلغ الختامي

source: Error
ar: خطأ

# enterValidNumber
source: Enter a valid number
ar: يرجى إدخال رقم صالح

source: End Session
ar: إنهاء الجلسة

source: Cancel
ar: إلغاء

# posSales
source: Sales
ar: المبيعات

# posScanError
source: Scan Error
ar: خطأ المسح

source: Not Found
ar: غير موجود

# noProductForBarcode
source: No product found for that barcode
ar: لم يتم العثور على منتج بهذا الباركود

# permissionDeniedSale
source: You do not have permission to sell
ar: لا تملك صلاحية إجراء عملية بيع

# noOpenSession
source: No open cash session
ar: لا يوجد جلسة مفتوحة

# openSessionFirst
source: Open a session before selling
ar: افتح جلسة قبل إجراء البيع

source: OK
ar: حسنًا

# closeAction
source: Close
ar: إغلاق

source: Checkout
ar: إتمام البيع

# openAction
source: Start Session
ar: بدء الجلسة

source: Confirm
ar: تأكيد

# multiPaymentTitle
source: Multiple Payment
ar: سداد متعدد الطرق

# totalLabel
source: Total:
ar: إجمالي:

source: Card
ar: بطاقة

source: Mobile
ar: هاتف

source: Cash
ar: نقدي

# remainingCashDue
source: Remaining Cash:
ar: المتبقي على النقدي:

# changeDue
source: Change:
ar: الباقي:

# posTitle
source: Point of Sale
ar: نقطة البيع

# quickItems
source: Quick
ar: سريع

# priceLabel
source: Price:
ar: السعر:

# quantityLabel
source: Qty:
ar: الكمية:

# basket
source: Cart
ar: السلة

source: Item
ar: منتج

source: Delete
ar: حذف

source: Add Item
ar: إضافة منتج

source: Scan RFID
ar: مسح RFID

# rfidCardsOptional
source: RFID Tags (Optional)
ar: بطاقات RFID (اختياري)

# addRfidCard
source: + Add Tag
ar: + إضافة بطاقة

# addRfidTitle
source: Add RFID Tag
ar: إضافة بطاقة RFID

source: Stop
ar: إيقاف

source: Scanning...
ar: جاري المسح...

# pressStop
source: Press stop when finished
ar: اضغط إيقاف عند الانتهاء

source: Warning
ar: تنبيه

# addedIgnored
source: Added {added} and ignored {ignored} (exceeded quantity)
ar: تمت إضافة {added} وتجاهل {ignored} لتجاوز الكمية

source: Not Enabled
ar: غير مفعّل

# enableRfidFirst
source: Enable RFID from settings first
ar: يرجى تفعيل RFID من الإعدادات أولاً

source: Scan Error
ar: خطأ المسح

source: Select Variant
ar: اختيار المنتج

source: Quantity
ar: الكمية

source: Cost
ar: التكلفة

# rfiCardsLimitReached
source: Cannot add more: reached quantity
ar: لا يمكن إضافة المزيد: عدد البطاقات بلغ الكمية

source: Choose
ar: اختيار

source: Received Date
ar: تاريخ الاستلام

source: Change
ar: تغيير

source: Done
ar: تم

source: Items
ar: مجموع الكاش

# purchaseInvoiceTitle
source: Purchase Invoice
ar: فاتورة مشتريات

source: Save
ar: حفظ

source: Supplier
ar: المورد

source: Select
ar: اختيار

source: Reference (Optional)
ar: Reference (اختياري)

# pickVariant
source: Pick a variant for each item
ar: اختر المنتج لكل عنصر

# qtyMustBePositive
source: Quantity must be a number > 0
ar: الكمية يجب أن تكون رقمًا أكبر من صفر

# costMustBePositive
source: Cost must be a number >= 0
ar: التكلفة يجب أن تكون رقمًا صفريًا أو أكبر

# rfidExceedsQty
source: RFID tags count ({count}) exceeds quantity ({qty})
ar: عدد بطاقات RFID ({count}) أكبر من الكمية ({qty})

# addAtLeastOne
source: Add at least one item
ar: أضف منتجًا واحدًا على الأقل

source: Supplier ID required
ar: Supplier ID مطلوب

# invoiceSaveFailed
source: Failed to save invoice: {error}
ar: فشل حفظ الفاتورة: {error}

# saleSuccessTitle
source: Success
ar: تمت العملية

# saleNumber
source: Sale ID: {id}
ar: رقم البيع: {id}

source: Print Receipt
ar: طباعة الإيصال

source: Save PDF
ar: حفظ PDF

source: Pay Cash
ar: دفع نقدًا

# permissionDeniedTitle
source: Not Allowed
ar: غير مسموح

# openSessionTitle
source: Start Session
ar: بدء الجلسة

source: Opening Float
ar: الرصيد الافتتاحي

# actualDrawerAmount
source: Actual cash in drawer
ar: المبلغ الفعلي في الدرج

# closedTitle
source: Closed
ar: تم الإغلاق

# variance
source: Variance: {value}
ar: الفرق: {value}

# cashDepositTitle
source: Cash Deposit
ar: إيداع نقدي

# cashWithdrawTitle
source: Cash Withdrawal
ar: سحب نقدي

source: Amount
ar: المبلغ

source: Reason (Optional)
ar: السبب (اختياري)

# openingFloatLabel
source: Opening Float: {value}
ar: الرصيد الافتتاحي: {value}

# cashSales
source: Cash Sales: {value}
ar: مبيعات نقدية: {value}

# depositsLabel
source: Deposits: {value}
ar: إيداعات: {value}

# withdrawalsLabel
source: Withdrawals: {value}
ar: سحوبات: {value}

# expectedCash
source: Expected Cash: {value}
ar: الرصيد المتوقع: {value}

# cashSessionTitle
source: Cash Session
ar: الجلسة النقدية

# depositAction
source: Deposit
ar: إيداع

# withdrawAction
source: Withdraw
ar: سحب

# reportsTitle
source: Reports
ar: التقارير

# dailySales90
source: Daily Sales (last 90 days)
ar: مبيعات يومية (آخر 90 يومًا)

# monthlySales24
source: Monthly Sales (last 24 months)
ar: مبيعات شهرية (آخر 24 شهرًا)

# topProductsQty
source: Top Products (by quantity)
ar: أفضل المنتجات (حسب الكمية)

source: Staff Performance
ar: أداء الموظفين

source: Purchases Total (period)
ar: إجمالي المشتريات (حسب الفترة)

# stockStatusLowFirst
source: Stock Status (lowest qty first)
ar: حالة المخزون (أقل كمية أولًا)

# pickEmployee
source: Select Employee
ar: اختر الموظف

# pickCategory
source: Select Category
ar: اختر الفئة

# pickSupplier
source: Select Supplier
ar: اختر المورد

# selectAction
source: Select
ar: تصفية

source: Clear Filters
ar: مسح المرشحات

# datePickerSelect
source: Select
ar: اختيار

# datePickerTitle
source: Pick Date
ar: اختر التاريخ

# searchPlaceholder
source: Search product or scan barcode
ar: ابحث عن المنتج أو امسح الباركود

# addAction
source: Add
ar: إضافة

# returnLabel
source: Return
ar: مرتجع

source: Currency
ar: العملة

# phoneLabel
source: Phone
ar: الهاتف

# saleReceiptLabel
source: Sale Receipt
ar: إيصال بيع

# userLabel
source: User
ar: المستخدم

# paymentMethodsLabel
source: Payment Methods
ar: طرق الدفع

# thanksLabel
source: Thank you for shopping!
ar: شكرًا لتسوقكم معنا

# xReportInterim
source: X Report (Interim Summary)
ar: تقرير X (ملخص مؤقت)

source: Z Report (Closing)
ar: تقرير Z (إغلاق)

# sessionLabel
source: Session: {id}
ar: الجلسة: {id}

# actualAmountLabel
source: Actual Amount: {value}
ar: المبلغ الفعلي: {value}

# cartEmpty
source: Cart is empty
ar: السلة فارغة

source: Enable RFID Reader
ar: تفعيل قارئ RFID

source: Debounce window (ms)
ar: زمن منع التكرار (مللي ثانية)

# ignoreSameTagWithinDuration
source: Ignore same tag within this duration
ar: تجاهل نفس الوسم ضمن هذه المدة

# rfParamsMayRequireRestart
source: RF parameters (may require reader restart)
ar: المعلمات اللاسلكية (قد تتطلب إعادة تشغيل القارئ)

# transmitPower
source: Transmit Power (RF Power)
ar: قوة الإرسال (RF Power)

source: Numeric value per reader
ar: قيمة رقمية حسب القارئ

# regionLabel
source: Region
ar: المنطقة

# rfidSettingsSaved
source: RFID settings saved successfully
ar: تم حفظ إعدادات RFID بنجاح

source: Page size (mm)
ar: حجم الصفحة (مم)

# widthPlaceholder58
source: Width (58)
ar: العرض (58)

# heightPlaceholder200
source: Height (200)
ar: الارتفاع (200)

source: Margin (mm)
ar: الهامش (مم)

# marginPlaceholder6
source: Margin (6)
ar: الهامش (6)

source: Font size (pt)
ar: حجم الخط (نقطة)

# fontSizePlaceholder10
source: Font size (10)
ar: حجم الخط (10)

source: Printing settings saved
ar: تم حفظ إعدادات الطباعة

# lowStockWarningThreshold
source: Low stock warning threshold (quantity)
ar: حد التحذير للمخزون منخفض (بالكمية)

# example5Placeholder
source: Example: 5
ar: مثال: 5

source: Settings saved
ar: تم حفظ الإعدادات

# storeNamePlaceholder
source: Store Name
ar: اسم المتجر

# addressPlaceholder
source: Address
ar: العنوان

# currencyPlaceholderLyd
source: Currency (LYD)
ar: العملة (LYD)

# infoSaved
source: Information saved
ar: تم حفظ المعلومات

source: Backup Now
ar: نسخ احتياطي الآن

source: Restore Now
ar: استعادة الآن

# dbFilePathPlaceholder
source: DB file path
ar: مسار ملف .db

source: Choose File
ar: اختيار ملف

# backupCreatedAt
source: Backup created at: {path}
ar: تم إنشاء نسخة احتياطية في: {path}

source: Backup Failed
ar: فشل النسخ الاحتياطي

# enterDbPathFirst
source: Enter .db file path first
ar: أدخل مسار ملف .db أولاً

source: File does not exist
ar: الملف غير موجود

# schemaVersionMismatch
source: Schema version mismatch (current: {current}, backup: {backup})
ar: إصدار المخطط لا يطابق (الحالي: {current}، النسخة: {backup})

# restoreSuccess
source: Restore completed successfully
ar: تمت الاستعادة بنجاح

source: Restore Failed
ar: فشل الاستعادة

# backupSection
source: Backup
ar: نسخ احتياطي

# restoreSection
source: Restore
ar: استعادة

# restoreVersionPromptTitle
source: Version Mismatch
ar: اختلاف الإصدار

# restoreVersionPromptMessage
source: Current schema {current} vs backup {backup}. Proceed anyway? (App may crash if incompatible)
ar: إصدار المخطط الحالي {current} مقابل النسخة {backup}. هل تريد المتابعة؟ (قد يتعطل التطبيق إن كان غير متوافق)

source: Proceed
ar: متابعة

source: Skip
ar: تخطي

# sameVersion
source: Versions match ({version})
ar: الإصدارات متطابقة ({version})

source: Open print dialog
ar: إظهار نافذة الطباعة

source: Default printer
ar: الطابعة الافتراضية

source: None
ar: لا يوجد

source: Choose Printer
ar: اختيار طابعة

source: Clear Default
ar: مسح الافتراضي

source: Test Printer
ar: اختبار الطابعة

# manageAttributesTitle
source: Manage Attributes
ar: إدارة الخصائص

# attributeNoun
source: Attribute
ar: خاصية

source: No values yet
ar: لا توجد قيم بعد

# valueNoun
source: Value
ar: قيمة

source: No attributes loaded
ar: لم يتم تحميل أي خصائص

# addNewAttribute
source: Add attribute
ar: إضافة خاصية

# attributeNamePlaceholder
source: Attribute name
ar: اسم الخاصية

# nameRequired
source: Name is required
ar: الاسم مطلوب

# attributeExists
source: An attribute with that name already exists
ar: خاصية بهذا الاسم موجودة بالفعل

source: Attribute added
ar: تمت إضافة الخاصية

source: Edit attribute
ar: تعديل الخاصية

source: Attribute saved
ar: تم حفظ الخاصية

# addNewValue
source: Add value
ar: إضافة قيمة

# valuePlaceholder
source: Value
ar: القيمة

# valueRequired
source: Value is required
ar: القيمة مطلوبة

source: Value added
ar: تمت إضافة القيمة

source: Edit value
ar: تعديل القيمة

source: Value saved
ar: تم حفظ القيمة

source: Confirm delete
ar: تأكيد الحذف

# deleteAttributePrompt
source: Delete attribute {name}?
ar: حذف الخاصية {name}?

# deleteValuePrompt
source: Delete value {value}?
ar: حذف القيمة {value}?

source: Attribute deleted
ar: تم حذف الخاصية

source: Value deleted
ar: تم حذف القيمة

source: Edit line
ar: تعديل السطر

source: Discount (amount)
ar: الخصم (مبلغ)

source: Tax (amount)
ar: الضريبة (مبلغ)

# noteLabel
source: Note
ar: ملاحظة

source: Exact
ar: المبلغ بالضبط

source: Categories
ar: الفئات

# stocktakeTitle
source: Stocktake
ar: الجرد

# searchProductPlaceholder
source: Search products...
ar: ابحث عن منتج...

# countedUnitsLabel
source: Counted
ar: مجرود

# uncountedUnitsLabel
source: Uncounted
ar: غير مجرود

# countedCostLabel
source: Counted cost
ar: تكلفة المجرود

# countedProfitLabel
source: Profit
ar: الربح

source: Start RFID
ar: بدء قراءة RFID

source: Stop reading
ar: إنهاء القراءة

source: Add by barcode
ar: إضافة بالباركود

# sizeLabel
source: Size:
ar: المقاس:

# colorLabel
source: Color:
ar: اللون:

# skuLabel
source: SKU:
ar: رقم الصنف:

# barcodeLabel
source: Barcode:
ar: الباركود:
